# Week 6 Module 2 Assignment 1
## Francis Yang 11/9/2022
### Part A: Identifying missing values in tabular data

**Step 1: Read the csv "file" as a pandas dataframe**

In [1]:
import pandas as pd
from io import StringIO
import sys

csv_data = \
'''A,B,C,D
1.0,2.0,3.0,4.0
5.0,6.0,,8.0
10.0,11.0,12.0,'''

# If you are using Python 2.7, you need
# to convert the string to unicode:

if (sys.version_info < (3, 0)):
    csv_data = unicode(csv_data)

data = pd.read_csv(StringIO(csv_data))
data

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

**Step 2: Check the number of missing values for the columns**

In [2]:
data.isnull().value_counts()

A      B      C      D
False  False  False  False    1
                     True     1
              True   False    1
dtype: int64

**Step 3: Access the underlying NumPy array via the values attribute**

In [3]:
data.values

array([[ 1.,  2.,  3.,  4.],
       [ 5.,  6., nan,  8.],
       [10., 11., 12., nan]])

**Step 4: Remove rows from df that contain missing values**

In [4]:
data.dropna()

     A    B    C    D
0  1.0  2.0  3.0  4.0

**Step 5: Remove columns from df that contain missing values**

In [5]:
data.dropna(axis=1)

      A     B
0   1.0   2.0
1   5.0   6.0
2  10.0  11.0

**Step 6: Only drop rows where all columns are NaN**

In [6]:
data.dropna(how='all')

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

**Step 7: Drop rows that have less than 3 real values**

In [7]:
data.dropna(thresh=3)

      A     B     C    D
0   1.0   2.0   3.0  4.0
1   5.0   6.0   NaN  8.0
2  10.0  11.0  12.0  NaN

**Step 8: Only drop rows where NaN appear in specific columns (here: 'C')**

In [8]:
data[data.C.notna()]

      A     B     C    D
0   1.0   2.0   3.0  4.0
2  10.0  11.0  12.0  NaN